# Знакомство с pandas

In [1]:
import pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df2 = pd.DataFrame({'A': 1.,
                     'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, dtype='int32'),
                     'E': pd.Categorical(["test", "train", "test", "train"]),
                     'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824
2013-01-04 -1.710613  1.185502  1.162823 -0.402228
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824
2013-01-04 -1.710613  1.185502  1.162823 -0.402228
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530

In [15]:
df.head()

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824
2013-01-04 -1.710613  1.185502  1.162823 -0.402228
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735

In [16]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.710613  1.185502  1.162823 -0.402228
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.372149 -0.340202  0.183519 -0.140156
std    1.267120  0.848874  1.391247  0.646321
min   -2.158528 -1.128042 -1.264417 -0.786693
25%   -1.307550 -0.912019 -1.020792 -0.614108
50%    0.115714 -0.552506  0.112378 -0.327432
75%    0.391693 -0.109481  1.060765  0.281489
max    0.992491  1.185502  2.162399  0.825824

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-03  0.329788 -0.978886 -1.264417  0.825824
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735
2013-01-04 -1.710613  1.185502  1.162823 -0.402228

## Выборка

In [21]:
df['A']

2013-01-01    0.992491
2013-01-02    0.412327
2013-01-03    0.329788
2013-01-04   -1.710613
2013-01-05   -2.158528
2013-01-06   -0.098361
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824
2013-01-04 -1.710613  1.185502  1.162823 -0.402228

In [24]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.992491 -1.128042
2013-01-02  0.412327 -0.393596
2013-01-03  0.329788 -0.978886
2013-01-04 -1.710613  1.185502
2013-01-05 -2.158528 -0.014776
2013-01-06 -0.098361 -0.711415

In [25]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.412327 -0.393596
2013-01-03  0.329788 -0.978886
2013-01-04 -1.710613  1.185502

In [27]:
df.loc['20130102', ['A', 'B']]

A    0.412327
B   -0.393596
Name: 2013-01-02 00:00:00, dtype: float64

In [28]:
df.iloc[3]

A   -1.710613
B    1.185502
C    1.162823
D   -0.402228
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.710613  1.185502
2013-01-05 -2.158528 -0.014776

In [30]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.412327  2.162399
2013-01-03  0.329788 -1.264417
2013-01-05 -2.158528  0.754589

In [31]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824

In [32]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.128042 -1.184445
2013-01-02 -0.393596  2.162399
2013-01-03 -0.978886 -1.264417
2013-01-04  1.185502  1.162823
2013-01-05 -0.014776  0.754589
2013-01-06 -0.711415 -0.529834

In [35]:
a = [1, 2, 3]
a[:]

[1, 2, 3]

In [36]:
a[1:]

[2, 3]

In [37]:
df.iloc[1, 1]

-0.3935958005288116

## Выборка по условию

In [38]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637
2013-01-02  0.412327 -0.393596  2.162399 -0.786693
2013-01-03  0.329788 -0.978886 -1.264417  0.825824

In [39]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.992491       NaN       NaN       NaN
2013-01-02  0.412327       NaN  2.162399       NaN
2013-01-03  0.329788       NaN       NaN  0.825824
2013-01-04       NaN  1.185502  1.162823       NaN
2013-01-05       NaN       NaN  0.754589       NaN
2013-01-06       NaN       NaN       NaN  0.459530

In [40]:
df2 = df.copy()

In [41]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637    one
2013-01-02  0.412327 -0.393596  2.162399 -0.786693    one
2013-01-03  0.329788 -0.978886 -1.264417  0.825824    two
2013-01-04 -1.710613  1.185502  1.162823 -0.402228  three
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735   four
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530  three

In [43]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.329788 -0.978886 -1.264417  0.825824   two
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735  four

In [44]:
df2['E'] = ['two', 'one', 'two', 'three', 'four', 'three']

In [45]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637   two
2013-01-03  0.329788 -0.978886 -1.264417  0.825824   two
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735  four

## Установка новых колонок

In [46]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [47]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [48]:
df['F'] = s1

In [50]:
df

                   A         B         C         D    F
2013-01-01  0.992491 -1.128042 -1.184445 -0.252637  NaN
2013-01-02  0.412327 -0.393596  2.162399 -0.786693  1.0
2013-01-03  0.329788 -0.978886 -1.264417  0.825824  2.0
2013-01-04 -1.710613  1.185502  1.162823 -0.402228  3.0
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735  4.0
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530  5.0

In [51]:
df.at[dates[0], 'A'] = 0

In [52]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.128042 -1.184445 -0.252637  NaN
2013-01-02  0.412327 -0.393596  2.162399 -0.786693  1.0
2013-01-03  0.329788 -0.978886 -1.264417  0.825824  2.0
2013-01-04 -1.710613  1.185502  1.162823 -0.402228  3.0
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735  4.0
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530  5.0

In [53]:
df.iat[0, 1] = 0

In [54]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.184445 -0.252637  NaN
2013-01-02  0.412327 -0.393596  2.162399 -0.786693  1.0
2013-01-03  0.329788 -0.978886 -1.264417  0.825824  2.0
2013-01-04 -1.710613  1.185502  1.162823 -0.402228  3.0
2013-01-05 -2.158528 -0.014776  0.754589 -0.684735  4.0
2013-01-06 -0.098361 -0.711415 -0.529834  0.459530  5.0

In [55]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [56]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.184445  5  NaN
2013-01-02  0.412327 -0.393596  2.162399  5  1.0
2013-01-03  0.329788 -0.978886 -1.264417  5  2.0
2013-01-04 -1.710613  1.185502  1.162823  5  3.0
2013-01-05 -2.158528 -0.014776  0.754589  5  4.0
2013-01-06 -0.098361 -0.711415 -0.529834  5  5.0

In [58]:
df2 = df.copy()

In [59]:
df2[df2 > 0] = -df2

In [60]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.184445 -5  NaN
2013-01-02 -0.412327 -0.393596 -2.162399 -5 -1.0
2013-01-03 -0.329788 -0.978886 -1.264417 -5 -2.0
2013-01-04 -1.710613 -1.185502 -1.162823 -5 -3.0
2013-01-05 -2.158528 -0.014776 -0.754589 -5 -4.0
2013-01-06 -0.098361 -0.711415 -0.529834 -5 -5.0

## Работа с пропусками

In [61]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [62]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -1.184445  5  NaN NaN
2013-01-02  0.412327 -0.393596  2.162399  5  1.0 NaN
2013-01-03  0.329788 -0.978886 -1.264417  5  2.0 NaN
2013-01-04 -1.710613  1.185502  1.162823  5  3.0 NaN

In [63]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [64]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.184445  5  NaN  1.0
2013-01-02  0.412327 -0.393596  2.162399  5  1.0  1.0
2013-01-03  0.329788 -0.978886 -1.264417  5  2.0  NaN
2013-01-04 -1.710613  1.185502  1.162823  5  3.0  NaN

In [65]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.412327 -0.393596  2.162399  5  1.0  1.0

In [66]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.184445  5  5.0  1.0
2013-01-02  0.412327 -0.393596  2.162399  5  1.0  1.0
2013-01-03  0.329788 -0.978886 -1.264417  5  2.0  5.0
2013-01-04 -1.710613  1.185502  1.162823  5  3.0  5.0

In [67]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Статистика

In [68]:
df.mean()

A   -0.537564
B   -0.152195
C    0.183519
D    5.000000
F    3.000000
dtype: float64

In [69]:
df.mean(1)

2013-01-01    0.953889
2013-01-02    1.636226
2013-01-03    1.017297
2013-01-04    1.727542
2013-01-05    1.516257
2013-01-06    1.732078
Freq: D, dtype: float64

## Применение функций к данным

In [70]:
df.apply(lambda x: x.max() - x.min())

A    2.570856
B    2.164388
C    3.426817
D    0.000000
F    4.000000
dtype: float64